Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250608114716565600000001]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250622110430595600000001]
data.aws_s3_bucket.lambda_code: Read complete after 1s [id=emenu-lambda-code-bucket]
data.aws_s3_object.lambda_layer: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.lambda_layer: Read complete after 1s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:10]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_2WdKaZBr3]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_2WdKaZBr3/boss]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_2WdKaZBr3/demo]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lm6flioizrdddozk5t274itu3u]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=40nv3qru4flrlbcjftgq7qd7q0]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_2WdKaZBr3/waiter]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=49p6ip9mueeacuanocf5hh73qm]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lm6flioizrdddozk5t274itu3u-emenu_datasource]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lm6flioizrdddozk5t274itu3u-Query-listDishes]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lm6flioizrdddozk5t274itu3u-Query-getUser]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lm6flioizrdddozk5t274itu3u-Mutation-createRestaurant]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.emenu_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "emenu_post_confirmation" {
        id                             = "emenu_post_confirmation"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:11",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_server will be updated in-place
  ~ resource "aws_lambda_function" "emenu_server" {
        id                             = "emenu-server"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:11",
        ] -> (known after apply)
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.common_mongoose_models must be replaced
-/+ resource "aws_lambda_layer_version" "common_mongoose_models" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:10" -> (known after apply)
      ~ code_sha256                 = "A6rSfEe+zQH9rgBKwE135MR9JcydLnJxSrW6NDEkOEw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-17T12:09:04.367+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "8a48eabe4980f18be1de36ed3fa4ac6f" -> "dd00dfad4425235fa55ff8e39ec362b9" # forces replacement
      ~ source_code_size            = 2780920 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_connect_string_param will be updated in-place
  ~ resource "aws_ssm_parameter" "db_connect_string_param" {
        id              = "/emenu/dev/db_connection_string"
      + insecure_value  = (known after apply)
        name            = "/emenu/dev/db_connection_string"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 4 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
